<?php

//Возвращает значения по ID из Json

$keys = [
    0 => "empty",
    1 => "Жилой дом 1",
    2 => "Жилой дом 2",
    3 => "Жилой дом 3",
    4 => "Жилой дом 4",
    5 => "Жилой дом 5",
    6 => "Жилой дом 6",
    7 => "Больница №1",
    8 => "Мини ветрогенератор",
    9 => "Завод №1",
    10 => "Солнечная панель №1",
    11 => "Завод №2",
    12 => "Солнечная панель №2",
    13 => "Основной генератор",
    14 => "Ветрогенератор №1",
    15 => "Ветрогенератор №2",
    16 => "Ветрогенератор №3",
];

$get = $_GET["get"];

if (!empty($get)) {
    $exists = array_key_exists($get, $keys);
    if ($exists != 1) {
        echo "Error with key";
    } else {
        echo $keys[$get];
    }
} else {
    echo "Await get..";
}
